<template>
    <div class="b-popup">
      <!-- иконка закрытия при нажатии на которую срабатывает обработчик события "On" -->
      <img class = "close-img" src="..\Img\close.png" alt="" @click="On">
      <!-- Описание функционала приложения-->
      <div class="b-popup-content">
        ● На основе предложенного макета в проекте создана HTML страница с тремя колонками для элементов с текстом, олицетворяющих карточки с лексикой. Структура карточки позволяет разместить текст заголовка и текст содержания. Карточки разного цвета, как продемонстрировано на макете. <br>
        ● Предложенные к заданию данные содержат список тем, фраз на иностранном языке и соответствующих им переводов. Программным образом выполнено наполнение колонки карточками, используя тексты на иностранном языке. Цвет, а также тексты для заголовков и содержания выбраны случайным образом из предложенных к заданию данных. Использованны все данные, при этом первая колонка содержит от трех до пяти карточек(согласно заданию). Карточки упорядочены в каждой колонке по количеству слов - от большего к меньшему. <br>
        ● Реализовано интерактивное поведение карточек: <br>
        ○ Подсветка при наведение курсора; <br>
        ○ Одинарное нажатие меняет текст содержания карточки на соответствующий перевод. Обратное изменение происходит через определенный 3секунды; <br>
        ○ Двойное нажатие удаляет карточку. <br>

        ● Возможность использования сенсорного экрана. Совместимость решения с различным браузерами (Internet Explorer, Firefox, Chrome) и размерами экрана. <br>

        ● Реализовано редактирование и добавление новых карточек <br>
        ● Реализовано смена скинов по нажатию кнопки "skins". <br>
      </div>
    
    </div>
</template>

<script src="./help.js"></script>

<style src="./help.css"></style>
